backend/app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
    def index
        stories = Story.all