backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        if (user = User.find_by(id: params[:id]))

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."country" = $1 LIMIT $2  [["country", "Chad"], ["LIMIT", 1]]
UPDATE "locations" SET "user_id" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["user_id", nil], ["updated_at", "2021-02-12 23:25:20.764304"], ["id", 6]]
---
    def update_location
        @user = User.find(params[:id])
        @location = Location.find_by(country: params[:country])

        if @user.valid? && @location

            @user.update(location: @location)